{
  "title": "aabbcc",
  "text": "ITERATIVE AND RECURSIVE METHDO\nWrite a C/C++ program to print Fibonacci series up to nth term using iteration also compute time complexity.\n\nWrite a C/C++ program to print Fibonacci series up to nth term using recursion also compute the time complexity in terms of input size.\n\n\nSEARCHING\nWrite a C/C++ program using linear search to search an element in an array also compute time complexity for an input of size N. \n\n\n\nRecursive Write a C/C++ program to perform binary search on an array of size N and compute time complexity for size N. \n\n\n\n\nSORTING\nWrite a C/C++ program to perform bubble sort on an integer array to sort it in ascending order and compute the time complexity for an input of size N. \n\n\n\nWrite a C/C++ program to perform insertion sort on an integer array to sort it in ascending order and compute the time complexity for an input of size N. \n\n\n\nWrite a C/C++ program to perform selection sort on an integer array to sort it in ascending order and compute the time complexity for an input of size N. \n\n\n\nWrite a C/C++ program to perform merge sort on an integer array to sort it in ascending order and compute the time complexity for an input of size N. \n\n\n\nWrite a C/C++ program to perform quick sort on an integer array to sort it in ascending order and compute the time complexity for an input of size N.\n\n\n\nWrite a C/C++ program to perform count sort on an integer array to sort it in ascending order and compute the time complexity for an input of size N. \n\n\n\nWrite a C/C++ program to perform radix sort on an integer array to sort it in ascending order and compute the time complexity for an input of size N. \n\n\n\n\nWrite a C/C++ program to insert an element into heap, also compute time complexity for an input of size N. \n\n\n\n\nWrite a C/C++ program to delete the N element from a heap, also compute time complexity for those N elements. \n\n\n\nWrite a C/C++ program to build a heap using heapify and use it to perform heap sort, also compute the time complexity for an input of size N. \n\n\n\n\n\n\n\nWrite a C/C++ program to perform heap sort on an integer array to sort it in ascending order and compute the time complexity for an input of size N. \n\n\n\n\nWrite a C/C++ program to implement dynamic array. First take maximum length of array from user input. Then start by creating array of size 1, and start taking input. Every time the array is full, double its capacity. Use amortize analysis (aggregate) to calculate time complexity of the program \n\n\n\n\nWrite C/C++ program to implement stack with the use of array. Make a new function Multi Pop which pops k times. Take k as user input. Uses amortize analysis (accounting) to calculate time complexity of the program. \n\n\n\n\n\n\n\nWrite C/C++ program to implement KMP string matching method to find the pattern string in a text string both given by the user. Compute the complexity of the method for a text string of length N and pattern string of length M, where N>M. \n\n\n",
  "summary": "ITERATIVE AND RECURSIVE METHDO Write a C/C++ program to print Fibonacci series up to nth term using iteration also compute time complexity in terms of input size .Write a c/c++ program using linear search to search an element in an array also compute the time complexity for an input of size N . write a C/C++ program to perform merge sort on an integer array to sort it in ascending order . compute the time complexity for an input of size N.Write a c/c++ program . write a C/C++ program to implement dynamic array .first take maximum length of array from user input . then start by creating array of size 1 . every time the array is full, double its capacity .",
  "plagiarism_score": 0.3562065847223664,
  "timestamp": "2025-07-05T18:19:51.132746"
}